["Two weeks after her sudden death, royal family friend and British socialite Tara Palmer-Tomkinson was laid to rest on Monday in a private funeral. Her mother Patricia Palmer-Tomkinson, sister Santa Montefiore, former boyfriend and friend Duncan James, Duran Duran musician Nick Rhodes and businessman David Tang were among the mourners who attended the funeral in Dummer, Hampshire, England. Palmer-Tomkinson, who died on Feb. 8 from a perforated ulcer, according to her sister, grew up as a close friend to the royal family and attended Prince William and Princess Kate’s wedding in 2011. Charles and Camilla, Duchess of Cornwall, released a statement after her death was announced, saying they were “deeply saddened” by the news. No member of the royal family was in attendance at the funeral. Montefiore delivered an emotional eulogy for the late socialite, who died at just 45 years old. After the service, she took to Facebook to share the eulogy: I know that Tara is here with us today in Spirit, so I’m going to address this to her. My darling Tara I hope you know how much we miss you. From the moment you were born we were a family of five, but now we are four and that just isn’t right. I hope you’re aware of all the lovely things people have written about you, and that you are touched, because you never believed you lit up a room or made people feel special, but you did. You really did. I hope that you are resting, because you found life hard and now it is done. My beloved sister, I don’t think you realised that success is never about the big things, but about the small things, and that just being you was enough. I hope the old Dummer dogs have found you and given you a tremendous welcome, because you adored the dogs, and they will make Heaven feel more like home. I hope the angels wrap their wings around you, because, although you shrank from embraces in life, you need to be hugged. You really do. I hope you can make rabbit ears and witty rhymes up there, because your loopy humour was your gift to us and now it is your gift to them. How they will laugh. I envy them that. As your sister I always wanted to look after you and I tried, I really tried. I hope they are looking after you now in Heaven and that you are letting them, and that you heal. Most of all, my dearest Tara, I hope you know that we love you, with all our hearts, we really do. Montefiore also shared photos and a music video from the funeral on her Twitter account."]